name: "ai_classifier"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    dims: [1, 3, 224, 224]
  }
]

output [
  {
    name: "output_logits"
    data_type: TYPE_FP32
    dims: [1, 2]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 100
}